[
    {
        "id": 1,
        "title": "Kapsule K360",
        "nature": "Pro",
        "company": "Mobiteach",
        "duree": "Juin 2025 -",
        "tags": [
            "React",
            "Three.js",
            "R3F",
            "Scss",
            "Tailwind CSS",
            "Motion",
            "Gsap",
            "TypeScript"
        ],
        "description": "Cette Kapsule propose une immersion à 360° dans un univers interactif, développée avec React et Three.js. Grâce à R3F, des éléments 3D sont intégrés dans une image panoramique, enrichie de points d’intérêt permettant d’accéder à du contenu supplémentaire (informations, quiz, etc.). L’objectif est de proposer une expérience immersive et pédagogique, fluide et engageante.",
        "url": "https://k-hubs.com"
    },
    {
        "id": 2,
        "title": "Kapsule K-Hoot",
        "nature": "Pro",
        "company": "Mobiteach",
        "duree": "Avril - Mai 2025",
        "tags": ["React", "Tailwind CSS", "Motion", "TypeScript"],
        "description": "Création d’une Kapsule K-Hoot pour la plateforme K-Hubs, inspirée de Kahoot!. L’application propose trois modes de jeu dynamiques autour du quiz, visant à rendre l’apprentissage plus ludique et interactif.",
        "url": "https://k-hubs.com"
    },
    {
        "id": 3,
        "title": "Refactorisation",
        "nature": "Etu",
        "company": "IUT2 Grenoble",
        "duree": "Février - Mars 2025",
        "tags": ["Java", "Android", "Docker", "Symphony", "PHP", "PostgreSQL"],
        "description": "En équipe de 5, nous avons repris une application mobile et son back office Symfony, dédiée à la gestion des stages. Objectifs : refonte technique, correction de bugs et ajout de nouvelles fonctionnalités pour améliorer l’expérience utilisateur et la performance globale.",
        "url": "https://github.com/hugo-brb/CarnetStage"
    },
    {
        "id": 4,
        "title": "PhareAway",
        "nature": "Etu",
        "company": "IUT2 Grenoble",
        "duree": "Novembre 2024 - Janvier 2025",
        "tags": ["TypeScript", "React", "NextJs", "PostgreSQL", "Tailwind CSS"],
        "description": "Projet web visant à valoriser le patrimoine des phares français à travers une carte interactive et des escape games uniques. Chaque phare dispose de son propre mini-jeu scénarisé, permettant aux utilisateurs de découvrir son histoire et ses spécificités de manière ludique. Réalisé en équipe de 8.",
        "url": "https://phareaway.fun/"
    },
    {
        "id": 5,
        "title": "Portfolio d'un proche",
        "nature": "Perso",
        "duree": "Octobre 2024",
        "tags": ["TypeScript", "React", "NextJs", "Tailwind CSS", "i18n"],
        "description": "Création d’un portfolio moderne et performant en Next.js. J’ai conçu une interface intuitive, optimisé le SEO via le rendu SSR, intégré des animations interactives et des composants réutilisables. Ce projet m’a permis de perfectionner mes compétences en front-end tout en répondant précisément aux besoins de ma cliente.",
        "url": "https://portfolio-celia.fr/"
    },
    {
        "id": 6,
        "title": "Chief Arena",
        "nature": "Etu",
        "company": "IUT2 Grenoble",
        "duree": "Mai 2024 - Juillet 2024",
        "tags": ["JavaFx", "UML"],
        "description": "Chef de projet d’une équipe de 6 pour le développement d’une application JavaFX dédiée à l’organisation de concours culinaires. L’application propose des outils de planification, de gestion des participants et de suivi des événements. J’ai coordonné l’équipe, supervisé le développement et assuré la cohérence technique et fonctionnelle du projet.",
        "url": "https://github.com/hugo-brb/Projets_etu"
    },
    {
        "id": 7,
        "title": "Autres Petits Projets étudiants",
        "nature": "Etu",
        "company": "IUT2 Grenoble",
        "duree": "Septembre 2024 -",
        "tags": ["Java", "UML", "Docker", "Bash", "C/C++", "PostgreSQL"],
        "description": "Participation à plusieurs projets académiques, incluant la conception d'applications Java, la modélisation UML, l’utilisation de Docker, et des travaux en C/C++, Bash, et PostgreSQL. Ces expériences m'ont permis de consolider mes compétences techniques et de travailler sur des problématiques variées en équipe. L’ensemble de ces projets est consultable sur mon GitHub.",
        "url": "https://github.com/hugo-brb/Projets_etu"
    }
]
